Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: After a merge (initiated by git merge or git pull) stops because of conflicts, cleanly merged paths are already staged to be committed for you, and paths that conflicted are left in unmerged state.
zh_cn: 合并后(由 git merge 或 git pull 发起)由于冲突而停止，干净合并的路径已经被暂存为要为您提交，并且冲突的文件不再有未合并状态。

source: After building the state to be committed incrementally with these commands, git commit (without any pathname parameter) is used to record what has been staged so far.
zh_cn: 在使用这些命令构建状态增量后，使用 git commit (没有任何路径名参数)来记录到目前为止已暂存的内容。

source: After choosing the path, it presents the diff between the index and the working tree file and asks you if you want to stage the change of each hunk.
zh_cn: 选择路径后，它会显示索引和工作树文件之间的差异，并询问您是否要对每个 hunk 进行更改。

source: After deciding the fate for all hunks, if there is any hunk that was chosen, the index is updated with the selected hunks.
zh_cn: 在决定所有块的命运之后，如果选择了任何块，索引将随选定的块更新。

source: After making the selection, answer with an empty line to stage the contents of working tree files for selected paths in the index.
zh_cn: 进行选择后，用空行回答，对索引中所选路径的工作树文件的内容进行暂存。

source: After resolving conflicts and staging the result, git ls-files -u would stop mentioning the conflicted path.
zh_cn: 解决冲突和暂存结果后， git ls-files -u 将停止提及冲突的路径。

source: After resolving the conflict manually and updating the index with the desired resolution, you can continue the rebasing process with
zh_cn: 手动解决冲突并使用所需的解决更新索引后，您可以继续 rebasing 过程：

source: After running git reset <paths> to update the index entry, you can use git-checkout[1] to check the contents out of the index to the working tree.
zh_cn: 运行 git reset <paths> 更新索引条目后，可以使用 git-checkout[1] 检查索引中的内容到工作树。

source: After running this git push on the satellite machine, you would ssh into the mothership and run git merge there to complete the emulation of git pull that were run on mothership to pull changes made on satellite.
zh_cn: 在 satellite 机器上运行 git push 后，您将进入 mothership 并运行 git merge 完成在 mothership 上运行的 git pull 的仿真，以拉取 satellite 上的更改。

source: After staging changes to many files, you can alter the order the changes are recorded in, by giving pathnames to git commit.
zh_cn: 在更改许多文件之后，您可以通过将路径名指定为 git commit 来更改记录更改的顺序。

source: After that, the easiest way to record all removals, additions, and modifications in the working tree is:
zh_cn: 之后，在工作树中记录所有删除，添加和修改的最简单方法是：

source: After the above sequence, if you do:
zh_cn: 经过以上顺序，如果你这样做：

source: After the clone, a plain git fetch without arguments will update all the remote-tracking branches, and a git pull without arguments will in addition merge the remote master branch into the current master branch, if any (this is untrue when "--single-branch" is given; see below).
zh_cn: 克隆之后，没有参数的普通 git fetch 将更新所有远程跟踪分支，而没有参数的 git pull 将额外地将远程主分支合并到当前主分支（如果有的话）（当给出 "--single-branch" 时，这是不真实的;见下文）。

source: After the editor was closed, adjust the hunk headers and apply the patch to the index.
zh_cn: 编辑器关闭后，调整 hunk 标题并将补丁应用于索引。

source: After this three-way merge, the local modifications are not registered in your index file, so git diff would show you what changes you made since the tip of the new branch.
zh_cn: 在这种三路合并之后，本地的修改 没有 在您的索引文件中注册，所以 git diff 将显示您从新分支的提示之后所做的更改。

source: After working in the wrong branch, switching to the correct branch would be done using:
zh_cn: 在错误的分支工作后，切换到正确的分支将使用：

source: After you mastered the basic concepts, you can come back to this page to learn what commands Git offers.
zh_cn: 掌握基本概念后，您可以回到本页，了解 Git 提供的命令。

source: All changes made by commits in the current branch but that are not in <upstream> are saved to a temporary area.
zh_cn: 在当前分支中但不在 <upstream> 中的提交产生所有更改，都将保存到临时区域。

source: All objects are named by the SHA-1 hash of their contents, normally written as a string of 40 hex digits.
zh_cn: 所有对象都由其内容的 SHA-1 哈希命名，通常以40位数字的字符串形式写入。

source: All of these also allow you to omit the refspec from the command line because they each contain a refspec which git will use by default.
zh_cn: 所有这些还允许您从命令行中省略 refspec，因为它们各自包含默认情况下将使用 git 的 refspec。

source: All remote-tracking branches and configuration settings for the remote are removed.
zh_cn: 所有远程跟踪分支和远程的配置设置都将被删除。

source: All remote-tracking branches and configuration settings for the remote are updated.
zh_cn: 所有远程跟踪分支和远程的配置设置都会更新。

source: All submodule paths must be unique within the .gitmodules file.
zh_cn: 所有子模块路径在 .gitmodules 文件中必须是唯一的。

source: All writing options will per default write to the repository specific configuration file.
zh_cn: 所有写入选项将默认写入仓库特定的配置文件。

source: Allow adding otherwise ignored files.
zh_cn: 允许添加其他忽略的文件。

source: Allow recursive removal when a leading directory name is given.
zh_cn: 当给出开头目录名时允许递归删除。

source: Allowing web browsing of a repository
zh_cn: 允许网页浏览仓库

source: Also a leading directory name (e.g. dir to add dir/file1 and dir/file2) can be given to update the index to match the current state of the directory as a whole (e.g. specifying dir will record not just a file dir/file1 modified in the working tree, a file dir/file2 added to the working tree, but also a file dir/file3 removed from the working tree.
zh_cn: 还可以给出一个以目录开头的名称（例如 dir 来添加 dir/file1 和 dir/file2 ）来更新索引以匹配当前目录作为一个整体的状态（例如指定 dir 将不仅记录在工作树中修改的文件 dir/file1 ，文件 dir/file2 添加到工作树中，还从工作树中删除了一个文件 dir/file3 。

source: Also called "global" configuration file.
zh_cn: 也称为"全局"配置文件。

source: Also see "dirty".
zh_cn: 另请参阅 "dirty"。

source: Also the branch heads at the remote are copied directly to corresponding local branch heads, without mapping them to refs/remotes/origin/.
zh_cn: 远端的分支头也直接复制到相应的本地分支头，而不将它们映射到 refs/remotes/origin/ 。

source: Also when you are satisfied with the filtered result, press ENTER (empty) back to the main menu.
zh_cn: 此外，当您对筛选结果感到满意时，请按 ENTER (empty) 返回主菜单。

source: Also you can say ranges.
zh_cn: 你也可以说范围。

source: Also, a variable defined without = <value> is taken as true.
zh_cn: 另外，没有 = <value> 定义的变量被认为是 true 。

source: Also, when --force-with-lease option is used, the command refuses to update a remote ref whose current value does not match what is expected.
zh_cn: 此外，当使用 --force-with-lease 选项时，该命令拒绝更新当前值与预期不匹配的远程引用。

source: Alternate terms
zh_cn: 替代术语

source: Alternately you could rsync the changes into the working tree.
zh_cn: 或者，您可以 rsync 更改到工作树。

source: Alternatively, if the variable is set to an absolute path (starting with a / character), Git will interpret this as a file path and will try to write the trace messages into it.
zh_cn: 或者，如果变量设置为绝对路径(以 / 字符开头)，则 Git 会将其解释为文件路径，并尝试将跟踪消息写入其中。

source: Alternatively, using git-checkout[1] and specifying a commit, you can copy the contents of a path out of a commit to the index and to the working tree in one go.
zh_cn: 或者，使用 git-checkout[1] 并指定提交，您可以一次性将索引的内容从提交中复制到索引和工作树。

source: Alternatively, you can undo the git rebase with
zh_cn: 或者，您可以撤消 git rebase：

source: Although Git includes its own porcelain layer, its low-level commands are sufficient to support development of alternative porcelains.
zh_cn: 虽然 Git 包含自己的高层命令，但其低级命令足以支持替代高级命令的开发。

source: An alternate participant submission mechanism is using the git request-pull or pull-request mechanisms (e.g as used on GitHub (www.github.com) to notify your upstream of your contribution.
zh_cn: 可选的参与者提交机制是使用 git request-pull 或 pull-request 机制（例如，在 GitHub（www.github.com）上使用）通知您的上游关于您的贡献。

source: An empty string as search expression matches all lines.
zh_cn: 一个空字符串作为搜索表达式匹配所有行。

source: An entry for the path is placed in the index with no content.
zh_cn: 路径的条目被放置在没有内容的索引中。

source: An error happens when a source is neither existing nor controlled by Git, or when it would overwrite an existing file unless -f is given.
zh_cn: 当源既不存在也不受 Git 控制时，或者当覆盖现有文件时，除非给出了 -f ，否则会发生错误。

source: An example is to ask for a "tree" with <object> being a commit object that contains it, or to ask for a "blob" with <object> being a tag object that points at it.
zh_cn: 一个例子是要求一个 "树"，其中 <object> 是它包含的一个提交对象，或者要求一个 "blob"，其中 <object> 是指向它的标签对象。

source: An example:
zh_cn: 一个例子：

source: An initial HEAD file that references the HEAD of the master branch is also created.
zh_cn: 还会创建引用主分支的 HEAD 的初始 HEAD 文件。

source: An object to treat as the head of an unreachability trace.
zh_cn: 作为不可达性跟踪头的对象。

source: An optional prefix "!" which negates the pattern; any matching file excluded by a previous pattern will become included again.
zh_cn: 一个可选的前缀 "!" 用于否定模式;任何由先前模式排除的匹配文件将再次被包含。

source: An optional value suffix of k, m, or g in the config file will cause the value to be multiplied by 1024, 1048576, or 1073741824 prior to output.
zh_cn: 配置文件中的可选值后缀为 k ， m 或 g 将导致该值乘以1024,1048576或1073741824。

source: An sub-area lieutenant for a repository will act both as a participant and as an integrator.
zh_cn: 仓库的一个副区域副官将同时作为参与者和集成者。

source: Ancillary Commands
zh_cn: 辅助命令

source: Annotate file lines with commit information
zh_cn: 使用提交信息注释文件行

source: Annotated tags are meant for release while lightweight tags are meant for private or temporary object labels.
zh_cn: 注释标签用于发布，而轻量级标签用于私有或临时对象标签。

source: Annotates each line in the given file with information from the revision which last modified the line.
zh_cn: 注释给定文件中的每一行，用最后修改那行的修订版本的信息。

source: Another example of --onto option is to rebase part of a branch.
zh_cn: --onto 选项的另一个例子是变其分支的部分分支。

source: Another example:
zh_cn: 另一个例子：

source: Another option is to bypass the commit that caused the merge failure with git rebase --skip.
zh_cn: 另一个选择是使用 git rebase --skip 跳过导致合并失败的提交。

source: Any Git command accepting any <object> can also use the following symbolic notation:
zh_cn: 任何接受任何<object>的 Git 命令也可以使用以下符号表示法：

source: Any changes to tracked files in the working tree since <commit> are discarded.
zh_cn: 自 <commit> 以来，工作树中跟踪的文件的任何更改都将被丢弃。

source: Any single-valued variable set in this file will be overwritten by whatever is in ~/.gitconfig.
zh_cn: 此文件中设置的任何单值变量将被 ~/.gitconfig 中的任何内容覆盖。

source: Any valid <refspec> (like the ones in the examples below) can be configured as the default for git push origin.
zh_cn: 任何有效的<refspec>(如下面的例子中的那些)可以被配置为 git push origin 的默认值。

source: Append ref names and object names of fetched refs to the existing contents of .git/FETCH_HEAD.
zh_cn: 将引用的引用名称和对象名称附加到 .git/FETCH_HEAD 的现有内容中。

source: Appendix A: Git Quick Reference
zh_cn: 附录 A：Git 快速参考

source: Appendix B: Notes and todo list for this manual
zh_cn: 附录B：本手册的备注和待办清单

source: Applies a quilt patchset onto the current branch
zh_cn: 将 quilt 补丁集应用到当前分支上

source: Apply a patch to files and/or to the index
zh_cn: 对文件和/或索引应用补丁

source: Apply a series of patches from a mailbox
zh_cn: 从邮箱应用一系列补丁

source: Apply the change introduced by the commit at the tip of the master branch and create a new commit with this change.
zh_cn: 应用 master 分支尖端的提交引入的改变，并通过此更改创建新的提交。

source: Apply the changes introduced by all commits on the master branch that touched README to the working tree and index, so the result can be inspected and made into a single new commit if suitable.
zh_cn: 将 master 分支中所有有关 README 的提交引入的修改，应用到工作树和索引上，对结果进行检查并将其转换为单个新的提交。

source: Apply the changes introduced by all commits that are ancestors of maint or next, but not master or any of its ancestors.
zh_cn: 应用所有作为 maint 或 next 的祖先的提交，但不是 master 或其祖先的提交引入的更改。

source: Apply the changes introduced by all commits that are ancestors of master but not of HEAD to produce new commits.
zh_cn: 应用 master 分支所有的祖先，除了 HEAD ，引入的更改来生成新的提交。

source: Apply the changes introduced by some existing commits
zh_cn: 应用一些现有提交引入的更改

source: Apply the changes introduced by the fifth and third last commits pointed to by master and create 2 new commits with these changes.
zh_cn: 应用由 master 指向的第五和第三个提交引入的更改，并用这些更改创建两个新的提交。

source: Apply to the working tree and the index the changes introduced by the second last commit pointed to by master and by the last commit pointed to by next, but do not create any commit with these changes.
zh_cn: 将由 master 指向的倒数第二个提交 和 next 指向的最后一个提交，引入的更改应用到工作树和索引，但是不要使用这些更改来创建任何提交。

source: Arbitrary expressions cannot be used here, an actual ref must be named.
zh_cn: 任意表达式不能在这里使用，必须指定实际的 ref 。

source: As a convenience, --track without -b implies branch creation; see the description of --track below.
zh_cn: 为方便起见，没有 -b 的 --track 意味着分支创建;请参阅下面的 --track 的说明。

source: As a further special case, you may use "A...B" as a shortcut for the merge base of A and B if there is exactly one merge base.
zh_cn: 作为另一个特殊情况，您可以使用 "A...B" 作为 A 和 B 的合并基的快捷方式，如果只有一个合并基。

source: As a special case, the "@{-N}" syntax for the N-th last branch/commit checks out branches (instead of detaching).
zh_cn: 作为特殊情况，"@{-N}" 语法检出第 N 个最后的分支/提交为分支(而不是分离)。

source: As a special case, you may use "A...B" as a shortcut for the merge base of A and B if there is exactly one merge base.
zh_cn: 作为特殊情况，如果只有一个合并基础，则可以使用"A ... B"作为 A 和 B 的合并基础的快捷方式。

source: As a special rule, <rev>^0 means the commit itself and is used when <rev> is the object name of a tag object that refers to a commit object.
zh_cn: 作为特殊规则， <rev>^0 表示提交本身，当 <rev> 是引用提交对象的标签对象的对象名称时使用。

source: As no direct connection between the repositories exists, the user must specify a basis for the bundle that is held by the destination repository: the bundle assumes that all objects in the basis are already in the destination repository.
zh_cn: 由于存储库之间不存在直接连接，用户必须为目标存储库所持有的捆绑包指定一个基础：捆绑包假设基础中的所有对象都已在目标存储库中。

source: As with the case to record your own changes, you can use -a option to save typing.
zh_cn: 与记录您自己的更改的情况一样，您可以使用 -a 选项来保存打字。

source: Assume the following history exists and the current branch is "master":
zh_cn: 假设存在以下历史记录，当前分支是"master"：

source: Assume the following history exists and the current branch is "topic":
zh_cn: 假设存在以下历史，当前分支是"topic"：

source: At this point, git diff shows the changes cleanly merged as in the previous example, as well as the changes in the conflicted files.
zh_cn: 在这一点上， git diff 显示了像上一个例子中那样干净地合并的更改以及冲突文件的更改。

source: Augment the output of all queried config options with the origin type (file, standard input, blob, command line) and the actual origin (config file path, ref, or blob id if applicable).
zh_cn: 以源类型（文件，标准输入，blob，命令行）和实际源（配置文件路径，引用或 blob id（如果适用））增加所有查询配置选项的输出。

source: Authors
zh_cn: 作者

source: Automatically bisect a broken build between v1.2 and HEAD:
zh_cn: 在 v1.2 和 HEAD 之间自动二分查找一个损坏的构建：

source: Automatically bisect a broken test case:
zh_cn: 自动二分查找一个损坏的测试用例：

source: Automatically bisect a test failure between origin and HEAD:
zh_cn: 自动二分查找 oritin 与 HEAD 之间的测试失败：

source: Automatically bisect with temporary modifications (hot-fix):
zh_cn: 带临时修改(热修复)自动二分：

source: Automating
zh_cn: 自动化

source: Avoid using these constructs, or do so with extreme caution.
zh_cn: 避免使用这些结构，否则要非常小心。

source: Avoiding testing a commit
zh_cn: 避免测试提交

source: Backend for fast Git data importers
zh_cn: 后端快速 Git 数据导入

source: Basic Snapshotting
zh_cn: 快照基础

source: Basic bisect commands: start, bad, good
zh_cn: 基本的二分命令：start, bad, good

source: Be a little more verbose and show remote url after name.
zh_cn: 稍微更详细一些，并在名字后显示远程 URL。

source: Be quiet, only report errors, but not the files that are successfully removed.
zh_cn: 安静，只报告错误，不报告成功删除的文件。

source: Be quiet, only report errors.
zh_cn: 安静，只报告错误。

source: Be verbose.
zh_cn: 详细。

source: Because this example lets the shell expand the asterisk (i.e. you are listing the files explicitly), it does not consider subdir/git-foo.sh.
zh_cn: 因为这个例子让 shell 扩展星号(即你明确列出文件)，所以它不考虑 subdir/git-foo.sh 。

source: Because this example lets the shell expand the asterisk (i.e. you are listing the files explicitly), it does not remove subdir/git-foo.sh.
zh_cn: 因为这个例子让 shell 扩展星号(即你明确列出文件)，它不会移除 subdir/git-foo.sh 。

source: Before making a commit out of staged contents so far, stage the contents of paths given on the command line as well.
zh_cn: 在提交暂存的内容之前，在命令行上列出了暂存文件的内容。

source: Besides specifying a range of commits that should be listed using the special notations explained in the description, additional commit limiting may be applied.
zh_cn: 除了使用描述中说明的特殊符号指定应列出的提交范围外，还可以应用附加的提交限制。

source: Beware that modifying only half of the pair is likely to introduce confusing changes to the index.
zh_cn: 请注意，仅修改该对的一半可能会对索引引入混乱的更改。

source: Bidirectional operation between a Subversion repository and Git
zh_cn: Subversion 仓库和 Git 之间的双向操作

source: Blob Object
zh_cn: Blob 对象

source: Blog
zh_cn: 博客

source: Book
zh_cn: 书籍

source: Boolean false literals are no, off, false, 0 and the empty string.
zh_cn: 布尔 false 的文字是 no, off, false, 0 和空字符串。

source: Boolean true literals are yes, on, true, and 1.
zh_cn: 布尔 true 的文字是 yes, on, true, 和 1。

source: Borrow the objects from reference repositories specified with the --reference options only to reduce network transfer, and stop borrowing from them after a clone is made by making necessary local copies of borrowed objects.
zh_cn: 通过使用 --reference 选项指定的参考资料库中的对象，只能减少网络传输，并在通过进行借用对象的必需本地副本进行克隆后停止借用它们。

source: Both commit nodes B and C are parents of commit node A. Parent commits are ordered left-to-right.
zh_cn: 提交节点 B 和 C 都是提交节点 A 的父节点。父提交是从左到右排列的。

source: Branch management for a release
zh_cn: 发布的分支管理

source: Branch management for next and pu after a feature release
zh_cn: 功能发布后的下一个和 pu 的分支管理

source: Branch off of a specific tag.
zh_cn: 从特定标签检出分支。

source: Branch to checkout; if it refers to a branch (i.e., a name that, when prepended with "refs/heads/", is a valid ref), then that branch is checked out.
zh_cn: 要检出的分支，如果它引用一个分支（即一个前缀 "refs/heads/" 的有效的引用名)，将会检出那个分支。

source: Branching and Merging
zh_cn: 分支与合并

source: Browsing revisions
zh_cn: 浏览修订版本

source: Build a tree-object from ls-tree formatted text
zh_cn: 从 ls-tree 格式化的文本构建一个树对象

source: Build pack index file for an existing packed archive
zh_cn: 构建现有打包存档的包索引文件

source: But beware that because the patch is applied only to the index and not the working tree, the working tree will appear to "undo" the change in the index.
zh_cn: 但是要注意，因为修补程序仅应用于索引而不是工作树，所以工作树将显示为"撤消"索引中的更改。

source: But there are two parts of History Simplification, one part is selecting the commits and the other is how to do it, as there are various strategies to simplify the history.
zh_cn: 但是， 历史简化 有两个部分，一部分是选择提交，另一部分是如何做，因为有各种策略来简化历史。

source: By default (without --all or --tags) git describe only shows annotated tags.
zh_cn: 默认情况下(不包括--all 或--tags) git 描述仅显示注释标签。

source: By default index file version 2 or 3 is used.
zh_cn: 默认使用索引文件版本2或3。

source: By default the man program will be used to display the manual page, but the man.viewer configuration variable may be used to choose other display programs (see below).
zh_cn: 默认情况下， man 程序将用于显示手册页面，但 man.viewer 配置变量可用于选择其他显示程序(见下文)。

source: By default, git add will warn when adding an embedded repository to the index without using git submodule add to create an entry in .gitmodules.
zh_cn: 默认情况下，在向索引添加嵌入式仓库时，将不会使用 git submodule add 在 .gitmodules 中创建一个条目时，将会警告 git add 。

source: By default, any tag that points into the histories being fetched is also fetched; the effect is to fetch tags that point at branches that you are interested in.
zh_cn: 默认情况下，还会抓取指向正在获取的历史记录的任何标签;效果是获取指向您感兴趣的分支的标签。

source: By default, if you try to check out such an entry from the index, the checkout operation will fail and nothing will be checked out.
zh_cn: 默认情况下，如果您尝试从索引中检出这样的条目，则检出操作将失败，并且不会检出任何内容。

source: By default, only tags on fetched branches are imported (see git-fetch[1]).
zh_cn: 默认情况下，只导入抓取的分支上的标签(参见 git-fetch[1] )。

source: By default, the commits are shown in reverse chronological order.
zh_cn: 默认情况下，提交按时间倒序显示。

source: By default, tracked files are not shown at all since they are not subject to exclude rules; but see ‘--no-index’.
zh_cn: 默认情况下，跟踪的文件根本不显示，因为它们不受排除规则的限制;但是可查看 '--no-index'。

source: By using a refspec that fetches tags explicitly, you can fetch tags that do not point into branches you are interested in as well.
zh_cn: 通过使用显式提取标签的 refspec，您可以获取不指向您感兴趣的分支的标签。

source: By using this option the user can check if any of the given files would be ignored, no matter if they are already present in the work tree or not.
zh_cn: 通过使用此选项，用户可以检查任何给定的文件是否被忽略，无论它们是否已经存在于工作树中。

source: Bypass the post-rewrite hook.
zh_cn: 绕过 post-rewrite 钩子。

source: COMMANDS
zh_cn: 命令

source: COMMON DIFF OPTIONS
zh_cn: 常见差异选项

source: CONFIGURATION
zh_cn: 配置

source: CONFIGURATION FILE
zh_cn: 配置文件

source: CONFIGURATION VARIABLES
zh_cn: 配置变量

source: CONFIGURED REMOTE-TRACKING BRANCHES
zh_cn: 配置远程跟踪分支

source: Calling git stash without any arguments is equivalent to git stash save.
zh_cn: 没有任何参数调用 git stash 等同于 git stash save 。

source: Can be used to clear the sequencer state after a failed cherry-pick or revert.
zh_cn: 可以用于在 cherry-pick 或 revert 失败后清除顺序状态。

source: Can be used to continue after resolving conflicts in a failed cherry-pick or revert.
zh_cn: 可以在解决错误的 cherry-pick 或 revert 导致的冲突后使用以继续操作。

source: Can be used with additional commit message options (-m/-c/-C/-F).
zh_cn: 可以使用附加提交消息选项 (-m/-c/-C/-F).

source: Cancel the operation and return to the pre-sequence state.
zh_cn: 取消操作并返回到前序状态。

source: Changes between the index and your last commit; what you would be committing if you run "git commit" without "-a" option.
zh_cn: 索引和最后一次提交之间的更改;如果您运行“git commit”而没有“-a”选项，那么您将提交的内容。

source: Changes between the tips of the topic and the master branches.
zh_cn: 比较 topic 与主分支顶部之间的变化。

source: Changes in the git-add manual
zh_cn: git-add 手册中的更改

source: Changes in the git-clone manual
zh_cn: git-clone 手册中的更改

source: Changes in the git-config manual
zh_cn: git-config 手册中的更改

source: Changes in the git-help manual
zh_cn: git-help 手册中的更改

source: Changes in the git-init manual
zh_cn: git-init 手册中的更改

source: Changes in the git-mergetool manual
zh_cn: git-mergetool 手册中的更改

source: Changes in the git-rm manual
zh_cn: git-rm 手册中的更改

source: Changes in the git manual
zh_cn: git 手册中的更改

source: Changes in the working tree not yet staged for the next commit.
zh_cn: 工作树中尚未暂存进行下一次提交的更改。

source: Changes in the working tree since your last commit; what you would be committing if you run "git commit -a"
zh_cn: 自上次提交以来工作树中的更改;如果你运行"git commit -a"，你会提交的内容

source: Changes that occurred on the master branch since when the topic branch was started off it.
zh_cn: 从 topic 分支离开主分支开始时，主分支上发生的更改。

source: Check the GPG signature of commits
zh_cn: 检查提交的 GPG 签名

source: Check the GPG signature of tags
zh_cn: 检查标签的 GPG 签名

source: Check whether two branches point at the same history
zh_cn: 检查两个分支是否指向相同的历史记录

source: Checking out an old version of a file
zh_cn: 检出一个旧版本的文件

source: Checking the repository for corruption
zh_cn: 检查仓库是否有损坏

source: Cleans the working tree by recursively removing files that are not under version control, starting from the current directory.
zh_cn: 通过递归删除不在版本控制下的文件，来清除工作树，从当前目录开始。

source: Cleanup unnecessary files and optimize the local repository
zh_cn: 清理不必要的文件并优化本地仓库

source: Clone a repository into a new directory
zh_cn: 克隆一个仓库到新目录中

source: Clone from upstream while borrowing from an existing local directory:
zh_cn: 从现有本地目录借用时从上游克隆：

source: Clone from upstream:
zh_cn: 从上游克隆：

source: Clone only the history leading to the tip of a single branch, either specified by the --branch option or the primary branch remote’s HEAD points at.
zh_cn: 仅克隆由 --branch 选项或主分支远程的 HEAD 指定的单个分支的提示。

source: Clone the upstream and work on it.
zh_cn: 克隆上游并对其进行处理。

source: Clones a repository into a newly created directory, creates remote-tracking branches for each branch in the cloned repository (visible using git branch -r), and creates and checks out an initial branch that is forked from the cloned repository’s currently active branch.
zh_cn: 将仓库克隆到新创建的目录中，为克隆的仓库中的每个分支创建远程跟踪分支(使用 git branch -r 可见)，并创建并检出所克隆的仓库当前活动分支。

source: Cloning into an existing directory is only allowed if the directory is empty.
zh_cn: 仅当目录为空时才允许克隆到现有目录中。

source: Commit Formatting
zh_cn: 提交格式化

source: Commit Limiting
zh_cn: 提交限制

source: Commit Object
zh_cn: 提交对象
